ldc_set_location -site {AF1} [get_ports clk_125_i]
ldc_set_port -iobuf {IO_TYPE=LVDS} [get_ports clk_125_i]
ldc_set_location -site {AA3} [get_ports clk_125_en_o]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18} [get_ports clk_125_en_o]
#RGMII ch - 0
ldc_set_location -site {Y10} [get_ports rgmii_txc_0]
ldc_set_location -site {AB12} [get_ports rgmii_txctl_0]
ldc_set_location -site {Y11} [get_ports {rgmii_txd_0[0]}]
ldc_set_location -site {AA2} [get_ports {rgmii_txd_0[1]}]
ldc_set_location -site {Y2} [get_ports {rgmii_txd_0[2]}]
ldc_set_location -site {AB13} [get_ports {rgmii_txd_0[3]}]
ldc_set_location -site {Y7} [get_ports rgmii_rxc_0]
ldc_set_location -site {Y6} [get_ports rgmii_rxctl_0]
ldc_set_location -site {AC7} [get_ports {rgmii_rxd_0[0]}]
ldc_set_location -site {AC6} [get_ports {rgmii_rxd_0[1]}]
ldc_set_location -site {AD6} [get_ports {rgmii_rxd_0[2]}]
ldc_set_location -site {AD5} [get_ports {rgmii_rxd_0[3]}]
ldc_set_location -site {AA8} [get_ports rgmii_mdc_0]
ldc_set_location -site {Y9} [get_ports rgmii_mdio_0]
# RGMII ch - 1
ldc_set_location -site {Y4} [get_ports rgmii_txc_1]
ldc_set_location -site {AD2} [get_ports rgmii_txctl_1]
ldc_set_location -site {AB5} [get_ports {rgmii_txd_1[0]}]
ldc_set_location -site {AA4} [get_ports {rgmii_txd_1[1]}]
ldc_set_location -site {AC3} [get_ports {rgmii_txd_1[2]}]
ldc_set_location -site {AC2} [get_ports {rgmii_txd_1[3]}]
ldc_set_location -site {AB1} [get_ports rgmii_rxc_1]
ldc_set_location -site {AC1} [get_ports rgmii_rxctl_1]
ldc_set_location -site {Y8} [get_ports {rgmii_rxd_1[0]}]
ldc_set_location -site {AD12} [get_ports {rgmii_rxd_1[1]}]
ldc_set_location -site {AC12} [get_ports {rgmii_rxd_1[2]}]
ldc_set_location -site {AD11} [get_ports {rgmii_rxd_1[3]}]
ldc_set_location -site {Y3} [get_ports rgmii_mdc_1]
ldc_set_location -site {AC5} [get_ports rgmii_mdio_1]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18} [get_ports rgmii_rxc_0]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18} [get_ports rgmii_rxctl_0]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18} [get_ports {rgmii_rxd_0[*]}]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18 SLEWRATE=FAST} [get_ports rgmii_txc_0]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18 SLEWRATE=FAST} [get_ports rgmii_txctl_0]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18 SLEWRATE=FAST} [get_ports {rgmii_txd_0[*]}]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18} [get_ports rgmii_mdc_0]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18 PULLMODE=UP} [get_ports rgmii_mdio_0]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18} [get_ports rgmii_rxc_1]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18} [get_ports rgmii_rxctl_1]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18} [get_ports {rgmii_rxd_1[*]}]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18 SLEWRATE=FAST} [get_ports rgmii_txc_1]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18 SLEWRATE=FAST} [get_ports rgmii_txctl_1]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18 SLEWRATE=FAST} [get_ports {rgmii_txd_1[*]}]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18} [get_ports rgmii_mdc_1]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18 PULLMODE=UP} [get_ports rgmii_mdio_1]
ldc_set_attribute {USE_PRIMARY=TRUE} [get_nets {rgmii_txc_0_Z[0]}]
ldc_set_attribute {USE_PRIMARY=TRUE} [get_nets {rgmii_rxc_0_c[0]}]
ldc_set_attribute {USE_PRIMARY=TRUE} [get_nets {rgmii_txc_1_Z[0]}]
ldc_set_attribute {USE_PRIMARY=TRUE} [get_nets {rgmii_rxc_1_c[0]}]
# Push button switch
ldc_set_location -site {AC17} [get_ports resetn_i]
ldc_set_port -iobuf {PULLMODE=UP IO_TYPE=LVCMOS18} [get_ports resetn_i]
# DIP switch
ldc_set_location -site {AA16} [get_ports patgen_start]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18} [get_ports patgen_start]
# PHY RST
ldc_set_location -site {AA17} [get_ports {i_phy_resetn[0]}]
ldc_set_location -site {AL16} [get_ports {i_phy_resetn[1]}]
ldc_set_location -site {AA9} [get_ports {o_phy_resetn[0]}]
ldc_set_location -site {AD1} [get_ports {o_phy_resetn[1]}]
ldc_set_port -iobuf {PULLMODE=NONE IO_TYPE=LVCMOS18} [get_ports {i_phy_resetn[0]}]
ldc_set_port -iobuf {PULLMODE=NONE IO_TYPE=LVCMOS18} [get_ports {i_phy_resetn[1]}]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18} [get_ports {o_phy_resetn[*]}]
#Led Red - D22 to D29
ldc_set_location -site {AN15} [get_ports {LED_RED[0]}]
ldc_set_location -site {AH17} [get_ports {LED_RED[1]}]
ldc_set_location -site {AG17} [get_ports {LED_RED[2]}]
ldc_set_location -site {AM14} [get_ports {LED_RED[3]}]
ldc_set_location -site {AL14} [get_ports {LED_RED[4]}]
ldc_set_location -site {AK17} [get_ports {LED_RED[5]}]
ldc_set_location -site {AJ17} [get_ports {LED_RED[6]}]
ldc_set_location -site {AN14} [get_ports {LED_RED[7]}]
ldc_set_port -iobuf {IO_TYPE=LVCMOS18} [get_ports {LED_RED[*]}]
##ldc_set_attribute {USE_REGIONAL=TRUE} [get_nets rgmii_rxc_0_c]
# --------------------
# Timing Constraint
# --------------------
#Need to update clock period for different speed
#1G=8ns; 100M=40ns; 10M=400ns
create_clock -name {clk_125} -period 8 [get_ports clk_125_i]
create_clock -name {pllclk_125} -period 8 [get_pins u_tx_pll/lscc_pll_inst/gen_ext_outclkdiv.u_pll.PLLC_MODE_inst/CLKOP]
create_clock -name {clk_mdc} -period 100 [get_pins u_OSC/CLKOUT]
create_clock -name {rgmii_rxc_0} -period 8 -waveform {2 6} [get_ports rgmii_rxc_0]
create_clock -name {rgmii_rxc_1} -period 8 -waveform {2 6} [get_ports rgmii_rxc_1]
create_clock -name {rgmii_rxc_pad_0} -period 8
create_clock -name {rgmii_rxc_pad_1} -period 8
create_clock -name {genblk1.u1_ECLKDIV/ECLKDIVOUT} -period 200 [get_pins genblk1.u1_ECLKDIV/ECLKDIVOUT]
create_clock -name {genblk1.u2_ECLKDIV/ECLKDIVOUT} -period 400 [get_pins genblk1.u2_ECLKDIV/ECLKDIVOUT]
# - phase-shift 90 Degree
set_input_delay -clock [get_clocks rgmii_rxc_pad_0] -max 0.5 [get_ports {rgmii_rxctl_0 rgmii_rxd_0[*]}]
set_input_delay -clock [get_clocks rgmii_rxc_pad_0] -clock_fall -min -add_delay -0.5 [get_ports {rgmii_rxctl_0 rgmii_rxd_0[*]}]
set_input_delay -clock [get_clocks rgmii_rxc_pad_1] -max 0.5 [get_ports {rgmii_rxctl_1 rgmii_rxd_1[*]}]
set_input_delay -clock [get_clocks rgmii_rxc_pad_1] -clock_fall -min -add_delay -0.5 [get_ports {rgmii_rxctl_1 rgmii_rxd_1[*]}]
set_output_delay -clock [get_clocks pllclk_125] -max 1 [get_ports {rgmii_txctl_0 rgmii_txd_0[*]}]
set_output_delay -clock [get_clocks pllclk_125] -clock_fall -min -add_delay -0.8 [get_ports {rgmii_txctl_0 rgmii_txd_0[*]}]
set_output_delay -clock [get_clocks pllclk_125] -max 1 [get_ports {rgmii_txctl_1 rgmii_txd_1[*]}]
set_output_delay -clock [get_clocks pllclk_125] -clock_fall -min -add_delay -0.8 [get_ports {rgmii_txctl_1 rgmii_txd_1[*]}]
# RGMII TX output delay constraint
# PHY receive clock and data in center-aligned
# PHY has Tsu = 1ns and Th = 0.8ns
# Max-Delay = trace-data(max) - trace-clock(min) + Tsu
#           = 0 - 0 + 1 = 1ns
# Min-Delay = trace-data(min) - trace-clock(max) - Th
#           = 0 - 0 - 0.8 = -0.8ns
#-clock [get_clocks o_RGMII_1_TXC]
# RGMII RX input delay constraint
# PHY is send clock and data in center-aligned
# PHY has Tsu = 1.2ns and Th = 1.2ns
# Max-Delay = TU/2 - Tsu = 2ns - 1.2ns = 0.8ns
# Min-Delay = Th - TU/2 = 1.2ns - 2ns = -0.8ns
#PHY is send clock and data in edge-aligned
# PHY has Tskew += 0.5ns
# Max-Delay = Tskew = 0.5ns
# Min-Delay = -Tskew = -0.5ns
#-clock [get_clocks rgmii_1_rx_clk_virt]
# Exception Constraint
#set_false_path -to [get_ports {o_RGMII_1_TXC o_RGMII_2_TXC o_RGMII_3_TXC o_RGMII_4_TXC o_RGMII_5_TXC o_MPU_RGMII_3_RXC o_MPU_RGMII_2_RXC o_MPU_RGMII_1_RXC}]
set_false_path -from [get_clocks u_tx_pll/lscc_pll_inst/clkout_testclk_o]
set_false_path -from [get_ports {patgen_start resetn_i}]
set_false_path -to [get_ports {LED_RED[*]}]
#set_clock_groups -group [get_clocks {i_MPU_RGMII_1_TXC i_MPU_RGMII_2_TXC i_MPU_RGMII_3_TXC i_RGMII_1_RXC i_RGMII_2_RXC i_RGMII_3_RXC i_RGMII_5_RXC i_RGMII_4_RXC}] -group [get_clocks {clk_125m_pll_o}] -asynchronous
##set_clock_groups -group [get_clocks pllclk_125] -group [get_clocks rgmii_rxc_0] -group [get_clocks clk_mdc] -asynchronous
#set_clock_groups -group [get_clocks pllclk_125] -group [get_clocks rgmii_txc] -group [get_clocks {rgmii_rxc_0 rgmii_rxc_1}] -group [get_clocks clk_mdc] -group [get_clocks rvltck] -asynchronous
set_clock_groups -group [get_clocks pllclk_125] -group [get_clocks {rgmii_rxc_0 rgmii_rxc_1}] -group [get_clocks clk_mdc] -asynchronous
#ldc_set_location -site {AK11} [get_ports {o_phy_resetn[2]}]
#ldc_set_location -site {AM16} [get_ports {i_phy_resetn[2]}]
#ldc_set_port -iobuf {PULLMODE=NONE IO_TYPE=LVCMOS18} [get_ports {i_phy_resetn[2]}]
## RGMII ch - 3
#ldc_set_location -site {AC8} [get_ports i_MPU_RGMII_3_TXC]
#ldc_set_location -site {AD3} [get_ports i_MPU_RGMII_3_TX_CTL]
#ldc_set_location -site {AD4} [get_ports {i_MPU_RGMII_3_TXD[0]}]
#ldc_set_location -site {AD7} [get_ports {i_MPU_RGMII_3_TXD[1]}]
#ldc_set_location -site {AD9} [get_ports {i_MPU_RGMII_3_TXD[2]}]
#ldc_set_location -site {AD10} [get_ports {i_MPU_RGMII_3_TXD[3]}]
#ldc_set_location -site {AE14} [get_ports o_MPU_RGMII_3_RXC]
#ldc_set_location -site {AH10} [get_ports o_MPU_RGMII_3_RX_CTL]
#ldc_set_location -site {AD8} [get_ports {o_MPU_RGMII_3_RXD[0]}]
#ldc_set_location -site {AC15} [get_ports {o_MPU_RGMII_3_RXD[1]}]
#ldc_set_location -site {AC14} [get_ports {o_MPU_RGMII_3_RXD[2]}]
#ldc_set_location -site {AF14} [get_ports {o_MPU_RGMII_3_RXD[3]}]
#ldc_set_location -site {AK10} [get_ports MPU_RGMII_3_MDC]
#ldc_set_location -site {AJ10} [get_ports MPU_RGMII_3_MDIO]
## RGMII ch - 4
#ldc_set_location -site {AE22} [get_ports i_RGMII_1_RXC]
#ldc_set_location -site {AA20} [get_ports i_RGMII_1_RX_CTL]
#ldc_set_location -site {AB20} [get_ports {i_RGMII_1_RXD[0]}]
#ldc_set_location -site {AK25} [get_ports {i_RGMII_1_RXD[1]}]
#ldc_set_location -site {AL25} [get_ports {i_RGMII_1_RXD[2]}]
#ldc_set_location -site {Y20} [get_ports {i_RGMII_1_RXD[3]}]
#ldc_set_location -site {AK26} [get_ports o_RGMII_1_TXC]
#ldc_set_location -site {AD19} [get_ports o_RGMII_1_TX_CTL]
#ldc_set_location -site {AB19} [get_ports {o_RGMII_1_TXD[0]}]
#ldc_set_location -site {AA19} [get_ports {o_RGMII_1_TXD[1]}]
#ldc_set_location -site {AK28} [get_ports {o_RGMII_1_TXD[2]}]
#ldc_set_location -site {AK27} [get_ports {o_RGMII_1_TXD[3]}]
#ldc_set_location -site {AN16} [get_ports FPGA_PHY1_MDC]
#ldc_set_location -site {AC17} [get_ports FPGA_PHY1_MDIO]
# #RGMII ch - 5
#ldc_set_location -site {AK24} [get_ports i_RGMII_2_RXC]
#ldc_set_location -site {AM29} [get_ports i_RGMII_2_RX_CTL]
#ldc_set_location -site {AL28} [get_ports {i_RGMII_2_RXD[0]}]
#ldc_set_location -site {AE20} [get_ports {i_RGMII_2_RXD[1]}]
#ldc_set_location -site {AE21} [get_ports {i_RGMII_2_RXD[2]}]
#ldc_set_location -site {AL29} [get_ports {i_RGMII_2_RXD[3]}]
#ldc_set_location -site {AP29} [get_ports o_RGMII_2_TXC]
#ldc_set_location -site {AP27} [get_ports o_RGMII_2_TX_CTL]
#ldc_set_location -site {AN29} [get_ports {o_RGMII_2_TXD[0]}]
#ldc_set_location -site {AG25} [get_ports {o_RGMII_2_TXD[1]}]
#ldc_set_location -site {AF25} [get_ports {o_RGMII_2_TXD[2]}]
#ldc_set_location -site {AP28} [get_ports {o_RGMII_2_TXD[3]}]
#ldc_set_location -site {AF3} [get_ports FPGA_PHY2_MDC]
#ldc_set_location -site {AE3} [get_ports FPGA_PHY2_MDIO]
# #RGMII ch - 6
#ldc_set_location -site {AM24} [get_ports i_RGMII_3_RXC]
#ldc_set_location -site {AP26} [get_ports i_RGMII_3_RX_CTL]
#ldc_set_location -site {AM26} [get_ports {i_RGMII_3_RXD[0]}]
#ldc_set_location -site {AM25} [get_ports {i_RGMII_3_RXD[1]}]
#ldc_set_location -site {AF21} [get_ports {i_RGMII_3_RXD[2]}]
#ldc_set_location -site {AG21} [get_ports {i_RGMII_3_RXD[3]}]
#ldc_set_location -site {AH24} [get_ports o_RGMII_3_TXC]
#ldc_set_location -site {AH23} [get_ports o_RGMII_3_TX_CTL]
#ldc_set_location -site {AH25} [get_ports {o_RGMII_3_TXD[0]}]
#ldc_set_location -site {AN25} [get_ports {o_RGMII_3_TXD[1]}]
#ldc_set_location -site {AP25} [get_ports {o_RGMII_3_TXD[2]}]
#ldc_set_location -site {AJ23} [get_ports {o_RGMII_3_TXD[3]}]
#ldc_set_location -site {AH4} [get_ports FPGA_PHY3_MDC]
#ldc_set_location -site {AH3} [get_ports FPGA_PHY3_MDIO]
# #RGMII ch - 7
#ldc_set_location -site {AF6} [get_ports i_RGMII_4_RXC]
#ldc_set_location -site {AE10} [get_ports i_RGMII_4_RX_CTL]
#ldc_set_location -site {AF11} [get_ports {i_RGMII_4_RXD[0]}]
#ldc_set_location -site {AH6} [get_ports {i_RGMII_4_RXD[1]}]
#ldc_set_location -site {AH5} [get_ports {i_RGMII_4_RXD[2]}]
#ldc_set_location -site {AF10} [get_ports {i_RGMII_4_RXD[3]}]
#ldc_set_location -site {AK4} [get_ports o_RGMII_4_TXC]
#ldc_set_location -site {AG7} [get_ports o_RGMII_4_TX_CTL]
#ldc_set_location -site {AF9} [get_ports {o_RGMII_4_TXD[0]}]
#ldc_set_location -site {AE9} [get_ports {o_RGMII_4_TXD[1]}]
#ldc_set_location -site {AM4} [get_ports {o_RGMII_4_TXD[2]}]
#ldc_set_location -site {AL4} [get_ports {o_RGMII_4_TXD[3]}]
#ldc_set_location -site {AM13} [get_ports FPGA_PHY4_MDC]
#ldc_set_location -site {AG15} [get_ports FPGA_PHY4_MDIO]
# #RGMII ch - 8
#ldc_set_location -site {AF1} [get_ports i_RGMII_5_RXC]
#ldc_set_location -site {AN3} [get_ports i_RGMII_5_RX_CTL]
#ldc_set_location -site {AP4} [get_ports {i_RGMII_5_RXD[0]}]
#ldc_set_location -site {AE7} [get_ports {i_RGMII_5_RXD[1]}]
#ldc_set_location -site {AF7} [get_ports {i_RGMII_5_RXD[2]}]
#ldc_set_location -site {AM3} [get_ports {i_RGMII_5_RXD[3]}]
#ldc_set_location -site {AE5} [get_ports o_RGMII_5_TXC]
#ldc_set_location -site {AF4} [get_ports o_RGMII_5_TX_CTL]
#ldc_set_location -site {AF5} [get_ports {o_RGMII_5_TXD[0]}]
#ldc_set_location -site {AN1} [get_ports {o_RGMII_5_TXD[1]}]
#ldc_set_location -site {AM1} [get_ports {o_RGMII_5_TXD[2]}]
#ldc_set_location -site {AE4} [get_ports {o_RGMII_5_TXD[3]}]
#ldc_set_location -site {AG17} [get_ports FPGA_PHY5_MDC]
#ldc_set_location -site {AG14} [get_ports FPGA_PHY5_MDIO]
